#### Terraform Format 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```terraform
Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_iam_policy.sqs_policy will be created
+   resource "aws_iam_policy" "sqs_policy" {
+       arn              = (known after apply)
+       attachment_count = (known after apply)
+       description      = "Allow Lambda to read from SQS queue"
+       id               = (known after apply)
+       name             = "lambda_sqs_policy"
+       name_prefix      = (known after apply)
+       path             = "/"
+       policy           = (known after apply)
+       policy_id        = (known after apply)
+       tags_all         = (known after apply)
    }

  # aws_iam_role.lambda_role will be created
+   resource "aws_iam_role" "lambda_role" {
+       arn                   = (known after apply)
+       assume_role_policy    = jsonencode(
            {
+               Statement = [
+                   {
+                       Action    = "sts:AssumeRole"
+                       Effect    = "Allow"
+                       Principal = {
+                           Service = "lambda.amazonaws.com"
                        }
                    },
                ]
+               Version   = "2012-10-17"
            }
        )
+       create_date           = (known after apply)
+       force_detach_policies = false
+       id                    = (known after apply)
+       managed_policy_arns   = (known after apply)
+       max_session_duration  = 3600
+       name                  = "python_lambda_role"
+       name_prefix           = (known after apply)
+       path                  = "/"
+       tags_all              = (known after apply)
+       unique_id             = (known after apply)

+       inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_logs will be created
+   resource "aws_iam_role_policy_attachment" "lambda_logs" {
+       id         = (known after apply)
+       policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
+       role       = "python_lambda_role"
    }

  # aws_iam_role_policy_attachment.lambda_sqs_attach will be created
+   resource "aws_iam_role_policy_attachment" "lambda_sqs_attach" {
+       id         = (known after apply)
+       policy_arn = (known after apply)
+       role       = "python_lambda_role"
    }

  # aws_lambda_event_source_mapping.sqs_mapping will be created
+   resource "aws_lambda_event_source_mapping" "sqs_mapping" {
+       arn                           = (known after apply)
+       batch_size                    = 10
+       enabled                       = true
+       event_source_arn              = (known after apply)
+       function_arn                  = (known after apply)
+       function_name                 = (known after apply)
+       id                            = (known after apply)
+       last_modified                 = (known after apply)
+       last_processing_result        = (known after apply)
+       maximum_record_age_in_seconds = (known after apply)
+       maximum_retry_attempts        = (known after apply)
+       parallelization_factor        = (known after apply)
+       region                        = "ap-northeast-1"
+       state                         = (known after apply)
+       state_transition_reason       = (known after apply)
+       tags_all                      = (known after apply)
+       uuid                          = (known after apply)

+       amazon_managed_kafka_event_source_config (known after apply)

+       self_managed_kafka_event_source_config (known after apply)
    }

  # aws_lambda_function.python_lambda will be created
+   resource "aws_lambda_function" "python_lambda" {
+       architectures                  = (known after apply)
+       arn                            = (known after apply)
+       code_sha256                    = (known after apply)
+       filename                       = "./lambda/python_lambda.zip"
+       function_name                  = "python_handler"
+       handler                        = "handler.lambda_handler"
+       id                             = (known after apply)
+       invoke_arn                     = (known after apply)
+       last_modified                  = (known after apply)
+       memory_size                    = 128
+       package_type                   = "Zip"
+       publish                        = false
+       qualified_arn                  = (known after apply)
+       qualified_invoke_arn           = (known after apply)
+       region                         = "ap-northeast-1"
+       reserved_concurrent_executions = -1
+       role                           = (known after apply)
+       runtime                        = "python3.10"
+       signing_job_arn                = (known after apply)
+       signing_profile_version_arn    = (known after apply)
+       skip_destroy                   = false
+       source_code_hash               = (known after apply)
+       source_code_size               = (known after apply)
+       tags_all                       = (known after apply)
+       timeout                        = 3
+       version                        = (known after apply)

+       environment {
+           variables = {
+               "BUCKET_NAME"          = "incra-prod"
+               "ENV"                  = "production"
+               "FONT_NAME"            = "IPAexGothic"
+               "FONT_PATH"            = "ipam.ttf"
+               "R2_ACCESS_KEY_ID"     = "c59d06e561bbc963d0a459214c81a6d4"
+               "R2_ENDPOINT_URL"      = "https://8e457b2c3f9afaecffcc07978c972b96.r2.cloudflarestorage.com"
+               "R2_SECRET_ACCESS_KEY" = "1d8e96b6135049e31397e118fbd33c9ba738dd9eb2d8f0c7f33c6c9374332c42"
+               "REGION_NAME"          = "apac"
            }
        }

+       ephemeral_storage (known after apply)

+       logging_config (known after apply)

+       tracing_config (known after apply)
    }

  # aws_sqs_queue.my_queue will be created
+   resource "aws_sqs_queue" "my_queue" {
+       arn                               = (known after apply)
+       content_based_deduplication       = false
+       deduplication_scope               = (known after apply)
+       delay_seconds                     = 0
+       fifo_queue                        = false
+       fifo_throughput_limit             = (known after apply)
+       id                                = (known after apply)
+       kms_data_key_reuse_period_seconds = (known after apply)
+       max_message_size                  = 262144
+       message_retention_seconds         = 345600
+       name                              = "my-queue"
+       name_prefix                       = (known after apply)
+       policy                            = (known after apply)
+       receive_wait_time_seconds         = 0
+       redrive_allow_policy              = (known after apply)
+       redrive_policy                    = (known after apply)
+       region                            = "ap-northeast-1"
+       sqs_managed_sse_enabled           = (known after apply)
+       tags_all                          = (known after apply)
+       url                               = (known after apply)
+       visibility_timeout_seconds        = 30
    }

Plan: 7 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @yuorei, Working Directory: `pdf_generate/terraform`